#include<stdio.h>
#include<stdlib.h>

#define MAP_HEIGHT	10
#define	MAP_WIDTH	20

int map[MAP_HEIGHT][MAP_WIDTH]={
	{1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1},
    {4,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,1},
    {1,0,1,1,1,0,1,0,0,1,1,0,1,0,1,0,0,1,0,1},
    {1,0,1,0,1,0,0,1,0,0,1,0,0,1,0,1,0,1,0,1},
    {1,0,1,0,0,0,0,0,1,0,0,1,0,0,0,0,1,0,0,1},
	{1,0,0,1,0,1,0,0,0,1,0,0,1,0,1,0,0,1,0,1},
    {1,1,1,0,0,1,0,0,1,0,1,0,0,1,1,0,0,1,0,1},
    {1,0,1,0,1,1 ,1,1,0,0,1,0,1,0,0,0,0,1,0,1},
	{1,0,0,0,0,0,0,1,0,0,1,0,0,0,1,1,0,1,0,5},
	{1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1}};

void draw_map(void){
	int i,j;
	for(i=0; i<MAP_HEIGHT; i++){
		for(j=0; j<MAP_WIDTH; j++){
			switch(map[i][j]){
				case 0: printf("  "); break;//빈공간
				case 1: printf("■ "); break;//벽
				case 4: printf("  "); break;//캐릭터?
				case 5: printf("→ "); break;//출구
			}
		}
		printf("\n");
	}
}

void clear(){
	system("clear");
}

int main(){
	draw_map();
}
